UAV_Propeller/folder/Multicase_Optimization/Forward/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    blade
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32529;
        startFace       2691603;
    }
    inlet
    {
        type            patch;
        nFaces          3284;
        startFace       2724132;
    }
    outer
    {
        type            patch;
        nFaces          9176;
        startFace       2727416;
    }
    outlet
    {
        type            patch;
        nFaces          3276;
        startFace       2736592;
    }
    cyc1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4964;
        startFace       2739868;
        matchTolerance  0.01;
        transform       rotational;
        neighbourPatch  cyc2;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
    }
    cyc2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4964;
        startFace       2744832;
        matchTolerance  0.01;
        transform       rotational;
        neighbourPatch  cyc1;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
    }
)

// ************************************************************************* //
